doru91/connectedhomeip/third_party/nxp/k32w0_sdk/sdk_fixes/pin_mux.c
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v9.0
processor: K32W041AM
package_id: K32W041AMZ
mcu_data: ksdk2_0
processor_version: 9.0.0
pin_labels:
- {pin_num: '13', pin_signal: PIO0_10/CT32B0_CAP0/USART1_TXD/RFTX/I2C0_SCL/SPI0_SCK/PDM0_DATA, label: DBG_UART_TX, identifier: DBG_UART_TX}
- {pin_num: '14', pin_signal: PIO0_11/CT32B1_CAP0/USART1_RXD/RFRX/I2C0_SDA/SPI0_MISO/PDM0_CLK, label: DBG_UART_RX, identifier: DBG_UART_RX}
- {pin_num: '11', pin_signal: PIO0_8/SPI0_MOSI/USART0_TXD/CT32B0_MAT0/PWM8/ANA_COMP_OUT/RFTX/PDM1_DATA, label: APP_UART_TX, identifier: APP_UART_TX}
- {pin_num: '12', pin_signal: PIO0_9/SPI0_SSELN/USART0_RXD/CT32B1_CAP1/PWM9/USART1_SCK/ADO/PDM1_CLK, label: APP_UART_RX, identifier: APP_UART_RX}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_iocon.h"
#include "pin_mux.h"
#include "gpio_pins.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm4, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4 */
void BOARD_InitPins(void)
{
    /* Enable IOCON clock */
    CLOCK_EnableClock(kCLOCK_Iocon);
    CLOCK_EnableClock(kCLOCK_InputMux);

    CLOCK_EnableClock(kCLOCK_I2c1);
    CLOCK_AttachClk(kOSC32M_to_I2C_CLK);
    /* IOCON clock left on, this is needed if CLKIN is used. */
    /* Initialize GPIO */
    CLOCK_EnableClock(kCLOCK_Gpio0);
    RESET_PeripheralReset(kGPIO0_RST_SHIFT_RSTn);

#ifdef LUMI_DOORLOCK
   IOCON_PinMuxSet(IOCON,0,12,IOCON_FUNC5|IOCON_DIGITAL_EN|IOCON_STDI2C_EN);//I2C1_SCL
   IOCON_PinMuxSet(IOCON,0,13,IOCON_FUNC5|IOCON_DIGITAL_EN|IOCON_STDI2C_EN);//I2C1_SDA
   GPIO_PortInit(GPIO, 0);
#endif

#ifdef LUMI_OCCUPANCYSENSOR
    IOCON_PinMuxSet(IOCON,0,BOARD_OCCUPANCY_SENSOR_PWR_PIN,   IOCON_FUNC0|IOCON_DIGITAL_EN|IOCON_MODE_INACT|IOCON_IO_CLAMPING_NORMAL_MFIO);
    IOCON_PinMuxSet(IOCON,0,BOARD_OCCUPANCY_SENSOR_CTRL_L_PIN,IOCON_FUNC0|IOCON_DIGITAL_EN|IOCON_MODE_INACT|IOCON_IO_CLAMPING_NORMAL_MFIO);
    IOCON_PinMuxSet(IOCON,0,BOARD_OCCUPANCY_SENSOR_CTRL_M_PIN,IOCON_FUNC0|IOCON_DIGITAL_EN|IOCON_MODE_INACT|IOCON_IO_CLAMPING_NORMAL_MFIO);
    IOCON_PinMuxSet(IOCON,0,BOARD_OCCUPANCY_SENSOR_CTRL_H_PIN,IOCON_FUNC0|IOCON_DIGITAL_EN|IOCON_MODE_INACT|IOCON_IO_CLAMPING_NORMAL_MFIO);
    IOCON_PinMuxSet(IOCON,0,BOARD_OCCUPANCY_SENSOR_DET1_PIN,  IOCON_FUNC0|IOCON_DIGITAL_EN|IOCON_MODE_PULLUP);
    IOCON_PinMuxSet(IOCON,0,BOARD_OCCUPANCY_SENSOR_DET2_PIN,  IOCON_FUNC0|IOCON_DIGITAL_EN|IOCON_MODE_PULLUP);
   /* Define the init structure for the occupancy sensor ctrl output pin*/
    gpio_pin_config_t sensor_config = {
        kGPIO_DigitalOutput,
        1,
    };

    /* Init output sensor ctrl*/
    GPIO_PortInit(GPIO, 0);
    GPIO_PinInit(GPIO, 0, BOARD_OCCUPANCY_SENSOR_PWR_PIN, &sensor_config);
    GPIO_PinInit(GPIO, 0, BOARD_OCCUPANCY_SENSOR_CTRL_L_PIN, &sensor_config);
    GPIO_PinInit(GPIO, 0, BOARD_OCCUPANCY_SENSOR_CTRL_M_PIN, &sensor_config);
    GPIO_PinInit(GPIO, 0, BOARD_OCCUPANCY_SENSOR_CTRL_H_PIN, &sensor_config);
#endif
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDebugUARTPins:
- options: {callFromInitBoot: 'false', coreID: cm4, enableClock: 'true'}
- pin_list:
  - {pin_num: '13', peripheral: USART1, signal: TXD, pin_signal: PIO0_10/CT32B0_CAP0/USART1_TXD/RFTX/I2C0_SCL/SPI0_SCK/PDM0_DATA, egp: gpio, ecs: disabled, ehs: low,
    invert: disabled, filter_off: disabled, fsel: Below_50ns, open_drain: disabled, io_clamp: disabled}
  - {pin_num: '14', peripheral: USART1, signal: RXD, pin_signal: PIO0_11/CT32B1_CAP0/USART1_RXD/RFRX/I2C0_SDA/SPI0_MISO/PDM0_CLK, egp: gpio, ecs: disabled, ehs: low,
    invert: disabled, filter_off: disabled, fsel: Below_50ns, open_drain: disabled, io_clamp: disabled}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDebugUARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4 */
void BOARD_InitDebugUARTPins(void)
{
    /* Enables the clock for the I/O controller block. 0: Disable. 1: Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);

